cats_project/app/views/cats/show.html.erb

<h2>Rental Requests</h2>
    <% @requests = @cat.cat_rental_requests.order('start_date ASC')%>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date ASC  [["cat_id", 3]]