cats_project/app/controllers/cat_rental_requests_controller.rb

    def create
        @request = CatRentalRequest.new(cat_rental_request_params)
        @request.status = "PENDING"

        if @request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "status") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cat_id", 2], ["start_date", "2019-09-19"], ["end_date", "2019-09-30"], ["status", "PENDING"]]

    def current_cat_rental_request
        @rental_request ||=
          CatRentalRequest.includes(:cat).find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]