cats_project/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Peter"], ["color", "black"], ["updated_at", "2019-09-18 03:49:50.340076"], ["id", 1]]