cats_project/app/models/cat_rental_request.rb

    def does_not_overlap_approved_request
       overlapping_approved_requests.empty?
---
SELECT  1 AS one FROM "cat_rental_requests" WHERE (cat_id = 1) AND NOT (id = NULL or (start_date >= '2019-09-25' or end_date <= '2019-09-18')) AND (status = 'APPROVED') LIMIT $1  [["LIMIT", 1]]

    def approve!
        raise 'not pending' unless self.status == 'PENDING'
        transaction do
            self.update!(status: 'APPROVED')
            overlapping_pending_requests.each do |req|
                req.update!(status: 'DENIED')
---
UPDATE "cat_rental_requests" SET "status" = $1 WHERE "cat_rental_requests"."id" = $2  [["status", "APPROVED"], ["id", 19]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE (cat_id = 4) AND NOT (id = 19 or (start_date >= '2019-10-31' or end_date <= '2019-10-25')) AND (status = 'PENDING')
UPDATE "cat_rental_requests" SET "status" = $1 WHERE "cat_rental_requests"."id" = $2  [["status", "DENIED"], ["id", 22]]