first_routes_project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "eva"], ["email", "eva@binky.com"]]
---
    def create
        user = User.new(user_params)
         # replace the `user_attributes_here` with the actual attribute keys
         if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "Veronica"], ["id", 3]]
---
    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
    def destroy
        user = User.find_by(id: params[:id])
        if user.destroy