art_share_api/app/controllers/artworks_controller.rb

    def index
        @artwork = Artwork.where(artist_id: params[:user_id])
        ArtworkShare.where(viewer_id: params[:user_id]).each do |artworkshare|
            viewed_artwork = Artwork.find_by(id: artworkshare.artwork_id)
            @artwork += [viewed_artwork] if !@artwork.include?(viewed_artwork)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
        artwork = Artwork.find_by(id: params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def update
        artwork = Artwork.find_by(id: params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1 WHERE "artworks"."id" = $2  [["artist_id", 4], ["id", 4]]

    def destroy
        artwork = Artwork.find_by(id: params[:id])
        if artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]