art_share_api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
---
    def index
        # @comments = Comment.where
        # if params[:user_id]
        #     @comments = Comment.where(author_id: params[:user_id])
        # elsif params[:artwork_id]
        #     @comments = Comment.where(artwork_id: params[:artwork_id])
        # end

        # render json: @comments
        case
        when params[:user_id]
          comments = Comment.where(user_id: params[:user_id])
        when params[:artwork_id]
          comments = Comment.where(artwork_id: params[:artwork_id])