art_share_api/app/controllers/users_controller.rb

    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "bobby"], ["id", 2]]